FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ns_ЖурналРезультатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ns_ЖурналРезультатов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерВыгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ТипыСообщенийЖурналаРегистрации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ns_ЖурналРезультатов/Ext/ManagerModule.bsl
Процедура ОчиститьЖурнал() Экспорт
	НаборЗаписей = РегистрыСведений.ns_ЖурналРезультатов.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
КонецПроцедуры

Функция ЗаписатьОшибкиВЖурнал(ТаблицаОшибок) Экспорт
	Если ТаблицаОшибок.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_ЖурналРезультатов.НомерВыгрузки КАК НомерВыгрузки
	|ИЗ
	|	РегистрСведений.ns_ЖурналРезультатов КАК ns_ЖурналРезультатов
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерВыгрузки УБЫВ";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		НомерВыгрузки = 1;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		НомерВыгрузки = Выборка.НомерВыгрузки + 1;
	КонецЕсли; 
	
		
	МенеджерЗаписи = РегистрыСведений.ns_ЖурналРезультатов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.НомерВыгрузки = НомерВыгрузки;
	МенеджерЗаписи.ТипСообщения = Перечисления.ns_ТипыСообщенийЖурналаРегистрации.Ошибка;
	МенеджерЗаписи.Данные = Новый ХранилищеЗначения(ТаблицаОшибок, Новый СжатиеДанных(9));
	МенеджерЗаписи.Записать();
	
	Возврат НомерВыгрузки;
КонецФункции
